; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	image1 - mode
	spectrograph0 - mode
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation5 - direction
	Star0 - direction
	Star3 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 image1)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star4)
	(supports instrument4 image1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 image1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument6 spectrograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star3)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
)
(:goal (and
	(pointing satellite1 GroundStation5)
	(pointing satellite2 Star14)
	(have_image Phenomenon6 spectrograph0)
	(have_image Phenomenon7 image1)
	(have_image Star8 image1)
	(have_image Phenomenon9 image1)
	(have_image Star10 spectrograph0)
	(have_image Planet11 image1)
	(have_image Planet12 spectrograph0)
	(have_image Phenomenon13 image1)
	(have_image Star14 spectrograph0)
))

)

; plan
1. (turn_to satellite2 star3 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star3)
   goals met: 1 of 11
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 1 of 11
3. (calibrate satellite2 instrument6 star3)
   added: (calibrated instrument6)
   goals met: 1 of 11
4. (turn_to satellite2 planet11 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet11)
   goals met: 1 of 11
5. (take_image satellite2 planet11 instrument6 image1)
   added: (have_image planet11 image1)
   goals met: 2 of 11
6. (turn_to satellite2 phenomenon9 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon9)
   goals met: 2 of 11
7. (take_image satellite2 phenomenon9 instrument6 image1)
   added: (have_image phenomenon9 image1)
   goals met: 3 of 11
8. (turn_to satellite2 phenomenon7 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon7)
   goals met: 3 of 11
9. (take_image satellite2 phenomenon7 instrument6 image1)
   added: (have_image phenomenon7 image1)
   goals met: 4 of 11
10. (turn_to satellite2 phenomenon6 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon6)
   goals met: 4 of 11
11. (take_image satellite2 phenomenon6 instrument6 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 5 of 11
12. (turn_to satellite2 phenomenon13 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon13)
   goals met: 5 of 11
13. (take_image satellite2 phenomenon13 instrument6 image1)
   added: (have_image phenomenon13 image1)
   goals met: 6 of 11
14. (turn_to satellite2 planet12 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet12)
   goals met: 6 of 11
15. (take_image satellite2 planet12 instrument6 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 7 of 11
16. (turn_to satellite2 star10 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 star10)
   goals met: 7 of 11
17. (take_image satellite2 star10 instrument6 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 8 of 11
18. (turn_to satellite2 star8 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star8)
   goals met: 8 of 11
19. (take_image satellite2 star8 instrument6 image1)
   added: (have_image star8 image1)
   goals met: 9 of 11
20. (turn_to satellite2 star14 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star14)
   goals met: 10 of 11
21. (take_image satellite2 star14 instrument6 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 11 of 11
